In [1]:
import pandas as pd

In [2]:
data = {
    "students" : [
        {"name" :"A","marks" :"25","city" :"ngp"},
        { "name": "B", "marks": 78, "city": "Pune"},
        {"name": "C", "marks": 90, "city": "Mumbai"}
        
    ]
}
df = pd.json_normalize(data["students"])
df

  name marks    city
0    A    25     ngp
1    B    78    Pune
2    C    90  Mumbai

In [7]:
df.info()
df.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   marks   3 non-null      object
 2   city    3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

name     object
marks    object
city     object
dtype: object